SushiBits/platform-stm32f1/include/stm32f102x6_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f1xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt_IRQn)
IRQN_HANDLER(-13, HardFault_IRQn)
IRQN_HANDLER(-12, MemoryManagement_IRQn)
IRQN_HANDLER(-11, BusFault_IRQn)
IRQN_HANDLER(-10, UsageFault_IRQn)
SKIP_HANLDER(-9)
SKIP_HANLDER(-8)
SKIP_HANLDER(-7)
SKIP_HANLDER(-6)
IRQN_HANDLER(-5, SVCall_IRQn)
IRQN_HANDLER(-4, DebugMonitor_IRQn)
SKIP_HANLDER(-3)
IRQN_HANDLER(-2, PendSV_IRQn)
IRQN_HANDLER(-1, SysTick_IRQn)
IRQN_HANDLER(0, WWDG_IRQn)
IRQN_HANDLER(1, PVD_IRQn)
IRQN_HANDLER(2, TAMPER_IRQn)
IRQN_HANDLER(3, RTC_IRQn)
IRQN_HANDLER(4, FLASH_IRQn)
IRQN_HANDLER(5, RCC_IRQn)
IRQN_HANDLER(6, EXTI0_IRQn)
IRQN_HANDLER(7, EXTI1_IRQn)
IRQN_HANDLER(8, EXTI2_IRQn)
IRQN_HANDLER(9, EXTI3_IRQn)
IRQN_HANDLER(10, EXTI4_IRQn)
IRQN_HANDLER(11, DMA1_Channel1_IRQn)
IRQN_HANDLER(12, DMA1_Channel2_IRQn)
IRQN_HANDLER(13, DMA1_Channel3_IRQn)
IRQN_HANDLER(14, DMA1_Channel4_IRQn)
IRQN_HANDLER(15, DMA1_Channel5_IRQn)
IRQN_HANDLER(16, DMA1_Channel6_IRQn)
IRQN_HANDLER(17, DMA1_Channel7_IRQn)
IRQN_HANDLER(18, ADC1_IRQn)
IRQN_HANDLER(19, USB_HP_IRQn)
IRQN_HANDLER(20, USB_LP_IRQn)
SKIP_HANLDER(21)
SKIP_HANLDER(22)
IRQN_HANDLER(23, EXTI9_5_IRQn)
SKIP_HANLDER(24)
SKIP_HANLDER(25)
SKIP_HANLDER(26)
SKIP_HANLDER(27)
IRQN_HANDLER(28, TIM2_IRQn)
IRQN_HANDLER(29, TIM3_IRQn)
SKIP_HANLDER(30)
IRQN_HANDLER(31, I2C1_EV_IRQn)
IRQN_HANDLER(32, I2C1_ER_IRQn)
SKIP_HANLDER(33)
SKIP_HANLDER(34)
IRQN_HANDLER(35, SPI1_IRQn)
SKIP_HANLDER(36)
IRQN_HANDLER(37, USART1_IRQn)
IRQN_HANDLER(38, USART2_IRQn)
SKIP_HANLDER(39)
IRQN_HANDLER(40, EXTI15_10_IRQn)
IRQN_HANDLER(41, RTC_Alarm_IRQn)
IRQN_HANDLER(42, USBWakeUp_IRQn)

#endif

